Autodesk.Revit.DB.CombinableElement.Combinations
The geometry combinations that this element belongs to.
Remarks: If this combinable element does not belong to any geometry combination,
this value is an empty collection. A solid combinable element may belong to at most
one combination, while a void combinable element may belong to multiple combinations.

Autodesk.Revit.DB.CombinableElement
An element that can be added to a geometry combination.